nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/adchs/processor/adchs_p32mz1024efg064.h
PLIB_INLINE_API bool PLIB_ADCHS_AnalogInputIsAvailable(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     return ADCHS_AnalogInputIsAvailable_Default(index, analogInput);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsAnalogInputCheck(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsAnalogInputCheck_Default(index);
}

PLIB_INLINE_API uint32_t PLIB_ADCHS_ChannelConfigurationGet(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_ChannelConfigurationGet_Default(index, channelID);
}

PLIB_INLINE_API void PLIB_ADCHS_ChannelConfigurationSet(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID, uint32_t config)
{
     ADCHS_ChannelConfigurationSet_Default(index, channelID, config);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsChannelConfiguration(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsChannelConfiguration_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_AnalogInputDataReadyInterruptEnable(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     ADCHS_AnalogInputDataReadyInterruptEnable_Default(index, analogInput);
}

PLIB_INLINE_API void PLIB_ADCHS_AnalogInputDataReadyInterruptDisable(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     ADCHS_AnalogInputDataReadyInterruptDisable_Default(index, analogInput);
}

PLIB_INLINE_API bool PLIB_ADCHS_AnalogInputDataIsReady(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     return ADCHS_AnalogInputDataIsReady_Default(index, analogInput);
}

PLIB_INLINE_API uint32_t PLIB_ADCHS_AnalogInputResultGet(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     return ADCHS_AnalogInputResultGet_Default(index, analogInput);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsConversionResults(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsConversionResults_Default(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ADCHS_ChannelScanEnable(ADCHS_MODULE_ID index)
{
     ADCHS_ChannelScanEnable_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ADCHS_ChannelScanAbort(ADCHS_MODULE_ID index)
{
     ADCHS_ChannelScanAbort_Unsupported(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsScanEnable(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsScanEnable_Unsupported(index);
}

#endif
